tests/xml/200_charge_subscription_single.xml

<?xml version="1.0" encoding="utf-8"?>
<APIResponse version="20100929">
    <Header>
        <Date>2010-09-29T12:34:56+02:00</Date>
        <Path>API/chargeSubscription</Path>
        <ErrorCode>0</ErrorCode>
        <ErrorMessage/>
    </Header>
    <Body>
        <Result>Success</Result>
        <Transactions>
            <Transaction>
                <TransactionId>1</TransactionId>
                <PaymentId>ccc1479c-37f9-4962-8d2c-662d75117e9d</PaymentId>
                <CardStatus>Valid</CardStatus>
                <CreditCardToken>93f534a2f5d66d6ab3f16c8a7bb7e852656d4bb2</CreditCardToken>
                <CreditCardMaskedPan>411111******1111</CreditCardMaskedPan>
                <ThreeDSecureResult>Not_Applicable</ThreeDSecureResult>
                <LiableForChargeback>Merchant</LiableForChargeback>
                <BlacklistToken>4f244dec4907eba0f6432e53b17a60ebcf51365e</BlacklistToken>
                <ShopOrderId>myorderid</ShopOrderId>
                <Shop>AltaPay Shop</Shop>
                <Terminal>AltaPay Test Terminal</Terminal>
                <TransactionStatus>recurring_confirmed</TransactionStatus>
                <ReasonCode>NONE</ReasonCode>
                <MerchantCurrency>978</MerchantCurrency>
                <MerchantCurrencyAlpha>EUR</MerchantCurrencyAlpha>
                <CardHolderCurrency>978</CardHolderCurrency>
                <CardHolderCurrencyAlpha>EUR</CardHolderCurrencyAlpha>
                <ReservedAmount>0</ReservedAmount>
                <CapturedAmount>0</CapturedAmount>
                <RefundedAmount>0</RefundedAmount>
                <RecurringDefaultAmount>10.00</RecurringDefaultAmount>
                <CreatedDate>2010-09-28 12:34:56</CreatedDate>
                <UpdatedDate>2010-09-28 12:34:56</UpdatedDate>
                <PaymentNature>CreditCard</PaymentNature>
                <PaymentNatureService name="TestAcquirer">
                    <SupportsRefunds>true</SupportsRefunds>
                    <SupportsRelease>true</SupportsRelease>
                    <SupportsMultipleCaptures>true</SupportsMultipleCaptures>
                    <SupportsMultipleRefunds>false</SupportsMultipleRefunds>
                </PaymentNatureService>
                <FraudRiskScore>13.37</FraudRiskScore>
                <FraudExplanation>Fraud detection explanation</FraudExplanation>
                <PaymentInfos>
                    <PaymentInfo name="Form_Created_At">2010-09-28 12:34:56</PaymentInfo>
                    <PaymentInfo name="Form_Provider">AltaPay Test Form</PaymentInfo>
                    <PaymentInfo name="Merchant_Provided_Info">Some info by merchant</PaymentInfo>
                </PaymentInfos>
                <CustomerInfo/>
                <ReconciliationIdentifiers/>
            </Transaction>
            <Transaction>
                <TransactionId>2</TransactionId>
                <PaymentId>5387ebc9-f5d9-49f1-8b4d-44746369977a</PaymentId>
                <CardStatus>Valid</CardStatus>
                <CreditCardToken>93f534a2f5d66d6ab3f16c8a7bb7e852656d4bb2</CreditCardToken>
                <CreditCardMaskedPan>411111******1111</CreditCardMaskedPan>
                <ThreeDSecureResult>Not_Applicable</ThreeDSecureResult>
                <LiableForChargeback>Merchant</LiableForChargeback>
                <BlacklistToken>4f244dec4907eba0f6432e53b17a60ebcf51365e</BlacklistToken>
                <ShopOrderId>myorderid</ShopOrderId>
                <Shop>AltaPay Shop</Shop>
                <Terminal>AltaPay Test Terminal</Terminal>
                <TransactionStatus>captured</TransactionStatus>
                <ReasonCode>NONE</ReasonCode>
                <MerchantCurrency>978</MerchantCurrency>
                <MerchantCurrencyAlpha>EUR</MerchantCurrencyAlpha>
                <CardHolderCurrency>978</CardHolderCurrency>
                <CardHolderCurrencyAlpha>EUR</CardHolderCurrencyAlpha>
                <ReservedAmount>5.00</ReservedAmount>
                <CapturedAmount>5.00</CapturedAmount>
                <RefundedAmount>0</RefundedAmount>
                <RecurringDefaultAmount>0</RecurringDefaultAmount>
                <CreatedDate>2010-09-28 12:34:56</CreatedDate>
                <UpdatedDate>2010-09-28 12:34:56</UpdatedDate>
                <PaymentNature>CreditCard</PaymentNature>
                <PaymentNatureService name="TestAcquirer">
                    <SupportsRefunds>true</SupportsRefunds>
                    <SupportsRelease>true</SupportsRelease>
                    <SupportsMultipleCaptures>true</SupportsMultipleCaptures>
                    <SupportsMultipleRefunds>false</SupportsMultipleRefunds>
                </PaymentNatureService>
                <FraudRiskScore>13.37</FraudRiskScore>
                <FraudExplanation>Fraud detection explanation</FraudExplanation>
                <PaymentInfos/>
                <CustomerInfo/>
                <ReconciliationIdentifiers>
                    <ReconciliationIdentifier>
                        <Id>f4e2533e-c578-4383-b075-bc8a6866784a</Id>
                        <Amount currency="978">5.00</Amount>
                        <Type>captured</Type>
                        <Date>2010-09-28T12:34:56+02:00</Date>
                    </ReconciliationIdentifier>
                </ReconciliationIdentifiers>
            </Transaction>
        </Transactions>
    </Body>
</APIResponse>
